prodotto-kar/src/main/resources/NoPlugin/Esempi/DCSanita_CRM_2008-02_visualizzaListaReferti.in.xml

<?xml version="1.0" encoding="ISO-8859-1"?>
<!--
<TestInfo>
	<Autore></Autore>
	<DataPreparazione>31/01/2006</DataPreparazione>
	<CodiceTest>IN.8530197001</CodiceTest>
	<CodiceContesto>C06</CodiceContesto>
	<TipoTest>F</TipoTest>
	<Priorita>H</Priorita>
	<DescrizioneCaso>Test per verificare la non estrazione dell'attributo versioneDCE per la versione di contesto 2008-02</DescrizioneCaso>
	<DescrizioneRisultatoAtteso>Referto in chiaro con il campo versioneDCE vuoto</DescrizioneRisultatoAtteso>
</TestInfo>
-->
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" soap-env:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<soap-env:Header>
		<t:CoopContext xmlns:t="http://www.crs.lombardia.it/schemas/mw/2004-01/coopcontext/">
			<Transport>
				<Mode>Sync</Mode>
				<Dest>DCSanita</Dest>
			</Transport>
			<Security>
				<FunContext>
					<credential>
						<validity>
							<emittedDate>31/01/2006+11:53:56,937</emittedDate>
							<sessionMaxTime>31/01/2006+11:53:56,937</sessionMaxTime>
						</validity>
						<vrs>
							<mjr>1</mjr>
							<min>0</min>
						</vrs>
						<ctf>
							<reg>
								<cod/>
								<des/>
							</reg>
							<app>
								<cod/>
								<des/>
							</app>
							<pro>
								<cod/>
								<des/>
							</pro>
							<ter>
								<cod/>
								<des/>
							</ter>
							<str>
								<cod>030968</cod>
								<des/>
							</str>
							<pre>
								<cod>03096800</cod>
								<des/>
							</pre>
							<rep>
								<cod>5604</cod>
								<des/>
							</rep>
						</ctf>
						<role>
							<code>2</code>
							<description>Medico di pronto soccorso</description>
						</role>
						<userId>XXXXXX00X00X000X</userId>
						<iupSeed>030938</iupSeed>
					</credential>
				</FunContext>
				<CitCardPresent>true</CitCardPresent>
				<CitAuth>false</CitAuth>
				<CitCF>TSTCRM02T02T002T</CitCF>
				<CitSmartCardSN>171FW588</CitSmartCardSN>
			</Security>
			<Sla>
				<Log>
					<Global>
						<TrackID>1138272836562</TrackID>
						<Timestamp>31/01/2006+11:53:57,218</Timestamp>
					</Global>
				</Log>
			</Sla>
		</t:CoopContext>
		<a:AppContext xmlns:a="http://www.crs.lombardia.it/schemas/mw/2004-01/appcontext/">
			<Request clientProd="DCSanita" clientVer="9.1"/>
		</a:AppContext>
	</soap-env:Header>
	<soap-env:Body>
		<m:CRM.visualizzaListaReferti xmlns:m="http://www.crs.lombardia.it/schemas/DCSanita/CRM/2008-02/visualizzaListaReferti/" dataSetVersion="2008-02">
			<visualizzaListaReferti>
				<ll:CRSlegalContent xmlns:ll="http://www.crs.lombardia.it/schemas/mw/2004-01/legalContent/" type="Text" opLegSign="false" opWeakSign="false" feSign="false" citAttes="false" tStamp="false" verify="OK"/>
				<at:CRSattachment xmlns:at="http://www.crs.lombardia.it/schemas/mw/2004-01/attachment/"/>
				<st:CRSstream xmlns:st="http://www.crs.lombardia.it/schemas/mw/2004-01/stream/"/>
				<idCittadinoNonSISS/>
				<idAssistito/>
				<reteDiPatologia/>
				<codiceFiscaleCittadino>TSTCRM02T02T002T</codiceFiscaleCittadino>
				<tipoReferto/>
				<dataInizio>20010101</dataInizio>
				<dataFine>20011231</dataFine>
				<codiceMedicoRefertante/>
				<codiceStrutturaErogatrice/>
			</visualizzaListaReferti>
		</m:CRM.visualizzaListaReferti>
	</soap-env:Body>
</soap-env:Envelope>
